Nemo94/RHT_Logger/nRF5_SDK_11.0.0/examples/ble_peripheral/RHT_Logger/main.c

/** 
 * @brief RHT Logger Application main file.
 *
 * This file contains the source code for a sample server application using the RHT service.
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "ble_rhts.h"
#include "bsp.h"
#include "ble_gap.h"
#include "nrf_soc.h"
#include "nrf_nvic.h"
#include "app_util_platform.h"
#include "nrf_drv_timer.h"
#include <math.h>
#include "twi_master.h"
#include "htu21d.h"
#include "app_util.h"
#include "nrf_delay.h"

#define APP_DEBUG 1 //DEBUGGING FLAG - UART and PRINTF, as well as measurements interval is equal 1 s, not 1 min for debug purposes

#if (APP_DEBUG == 1)
#include "app_uart.h"

/*UART buffer size. */
#define UART_TX_BUF_SIZE 256
#define UART_RX_BUF_SIZE 1

#endif


#define CENTRAL_LINK_COUNT              0                                           /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT           1                                           /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define ADVERTISING_LED_PIN             BSP_LED_0_MASK                              /**< Is on when device is advertising. */
#define CONNECTED_LED_PIN               BSP_LED_1_MASK                              /**< Is on when device has connected. */


#define DEVICE_NAME                     "RHT_Sensor"                             /**< Name of device. Will be included in the advertising data. */

#define APP_ADV_INTERVAL                100                                          /**< The advertising interval (in units of 0.625 ms; this value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED       /**< The advertising time-out (in units of seconds). When set to 0, we will never time out. */

#define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_MAX_TIMERS            6                                           /**< Maximum number of simultaneously created timers. */
#define APP_TIMER_OP_QUEUE_SIZE         4                                           /**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)            /**< Minimum acceptable connection interval (0.125 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(200, UNIT_1_25_MS)            /**< Maximum acceptable connection interval (0.25 second). */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory time-out (4 seconds). */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(20000, APP_TIMER_PRESCALER) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (15 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)  /**< Time between each call to sd_ble_gap_conn_param_update after the first call (5 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define APP_GPIOTE_MAX_USERS            1                                           /**< Maximum number of users of the GPIOTE handler. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */
static ble_rhts_t                       m_rhts;                                      /**< LED Button Service instance. */


#define CURRENT_MEASUREMENTS 1U
#define CURRENT_MEASUREMENTS_RECEIVED 2U
#define MEASUREMENTS_HISTORY 3U 
#define HISTORY_MEASUREMENTS_RECEIVED 4U
#define DELETE_HISTORY 5U
#define HISTORY_DELETED 6U
#define CHANGE_INTERVAL 7U
#define INTERVAL_CHANGED 8U
#define CONNECTED 9U

#define ARRAY_SIZE 10

APP_TIMER_DEF(m_connection_event_timer_id);
#define CONNECTION_EVENT_TIMER_INTERVAL     APP_TIMER_TICKS(20, APP_TIMER_PRESCALER) // 25 ms intervals

const nrf_drv_timer_t TIMER_RHT_MEASUREMENT = NRF_DRV_TIMER_INSTANCE(1);


volatile uint32_t timer_overflow_count=0;

static int16_t current_humidity_measurement=0;
static int16_t current_temperature_measurement=0;

volatile uint32_t connection_counter=0;
#define MAX_CONN_EVENTS 1000U

#if (APP_DEBUG == 1)
volatile uint32_t interval=10; 	
#else
volatile uint32_t interval=60; 
#endif

volatile uint8_t status;
volatile uint16_t send_counter=0;
volatile uint8_t current_measurement_wait_counter=0;
extern uint16_t measurement_interval_in_minutes;
extern uint8_t command;
extern uint8_t status_received;

typedef enum
{
	ERROR=0U,
	READY=1U,
	BUSY=2U,
	COMPLETE=3U
}NRF_STATE_t;

typedef struct
{
	int16_t temperature_value_array[ARRAY_SIZE];
	uint16_t time_array[ARRAY_SIZE];
	int16_t humidity_value_array[ARRAY_SIZE];
	uint16_t next_measurement_position;
	uint16_t number_of_elements_existing;
}Measurements_History_t;

static Measurements_History_t History;
Measurements_History_t* History_p;

NRF_STATE_t nRF_State;

extern uint32_t received_data;

uint32_t parameters_merge(uint16_t parameter1, uint16_t parameter2)
{
	uint32_t result=0;
	result=65536*parameter1 | parameter2;

	return result;
}

uint32_t command_parameters_merge(uint16_t parameter1, uint8_t parameter2, uint8_t parameter3)
{
	uint32_t result=0;
	result= (uint32_t)65536*parameter1 | (parameter2<<8) | parameter3;

	return result;
}


