Nemo94/RHT_Logger/nRF5_SDK_11.0.0/examples/ble_peripheral/RHT_Logger/main.c
static uint32_t end_connection(void)
{
	uint32_t err_code;
	
	  if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle,  BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (err_code != NRF_SUCCESS) return err_code;
    }
		
	return NRF_SUCCESS;
}

void history_struct_init(void)
{
	History_p = &History;

	memset((void*)History_p, 0, sizeof(Measurements_History_t)); 
}

void measurements_history_add_element_to_array(int16_t new_temperature_measurement, int16_t new_humidity_measurement, uint16_t measurement_period)
{
	uint16_t position = 0; 
	uint16_t existing_elements;
	int16_t loop_counter = 0;
	
	
	if(History_p->number_of_elements_existing > ARRAY_SIZE)
	{
		History_p->number_of_elements_existing = ARRAY_SIZE + 1;
	}
	else
	{
		History_p->number_of_elements_existing++;
	}
	
	History_p->next_measurement_position++;
	
	if(History_p->next_measurement_position >= ARRAY_SIZE)
	{
		History_p->next_measurement_position=0;
	}
	
	if(History_p->next_measurement_position>=1)
	{
		position = History_p->next_measurement_position-1;
	}
	else
	{
		position = ARRAY_SIZE - 1; 
	}
	
	#if (APP_DEBUG == 1)
		//printf("New\n\r");
		printf("next meas pos = %u, pos =%u\n\r", History_p->next_measurement_position, position);
	#endif
	existing_elements = History_p->number_of_elements_existing;
	
	History_p->temperature_value_array[position] = new_temperature_measurement;
	History_p->humidity_value_array[position] = new_humidity_measurement;
	History_p->time_array[position] = 0;
	
	if(existing_elements >= ARRAY_SIZE)
	{
	
		if(position>=1)
		{
			for(loop_counter = (position-1); loop_counter >= 0; loop_counter--)
			{
				History_p->time_array[loop_counter] += measurement_period;
			
			}	
						
			for(loop_counter = (ARRAY_SIZE - 1); loop_counter >= (position + 1); loop_counter--)
			{
				History_p->time_array[loop_counter] += measurement_period;			
			}
		}
		else
		{
			for(loop_counter = (ARRAY_SIZE - 1); loop_counter >= 1; loop_counter--)
			{
				History_p->time_array[loop_counter] += measurement_period;		
			}
		}
	}
	else
	{
		for(loop_counter = (position-1); loop_counter >= 0; loop_counter--)
		{
			History_p->time_array[loop_counter] += measurement_period;			
		}		
	}	
	
				#if (APP_DEBUG == 1)
				//for(int j=0; j<ARRAY_SIZE; j++)
				//{
				//printf("Ti%u,T%d,H%d,n=%u\n\r", History_p->time_array[j],
				//																						History_p->temperature_value_array[j],
				//																						History_p->humidity_value_array[j],
				//																						History_p->next_measurement_position);
				//}
			#endif	
	
}

uint16_t measurements_history_get_position_from_array(uint16_t sent_element_counter)
{
	uint16_t position = 0; 
	uint16_t existing_elements;
	uint16_t element_to_send;
	
	existing_elements = History_p->number_of_elements_existing;
	position = History_p->next_measurement_position-1;
	
	if(existing_elements <= ARRAY_SIZE)
	{
		element_to_send = position - sent_element_counter; 
				#if (APP_DEBUG == 1)
		//printf("pos=%u, sec=%u\n\r", position, sent_element_counter);
		#endif

	}
	else
	{
		if((int16_t)((int16_t)position - (int16_t)sent_element_counter) >= 0)
		{
			 element_to_send = position - sent_element_counter; 
			
							#if (APP_DEBUG == 1)
		//printf("pos=%u, sec=%u\n\r", position, sent_element_counter);
		#endif
		}
		else
		{
			element_to_send = ARRAY_SIZE - sent_element_counter + position; 
			
							#if (APP_DEBUG == 1)
		//printf("pos=%u, sec=%u\n\r", position, sent_element_counter);
		#endif
		}				
	}
		#if (APP_DEBUG == 1)
		//printf("el2s=%u\n\r", element_to_send);
		#endif
	return element_to_send; 
}

void erase_measurements_history(void)
{
		memset((void*)History_p, 0, sizeof(Measurements_History_t)); 
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze 
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    LEDS_CONFIGURE(ADVERTISING_LED_PIN | CONNECTED_LED_PIN);
    LEDS_OFF(ADVERTISING_LED_PIN | CONNECTED_LED_PIN);
}




/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;

    ble_uuid_t adv_uuids[] = {{RHTS_UUID_SERVICE, m_rhts.uuid_type}};

    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = true;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;


    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = adv_uuids;

