Nemo94/RHT_Logger/nRF5_SDK_11.0.0/examples/ble_peripheral/RHT_Logger/main.c
static void timer_timeout_handler(void * p_context)
{	
		static uint32_t packet_temperature=0;
		static uint32_t packet_humidity=0;
		static uint32_t packet_command=0;
		static uint16_t RHT_step=0;
						#if (APP_DEBUG == 1)
							//printf("I'm in connection!\n\r");
						#endif
		switch(command)
		{
			case CURRENT_MEASUREMENTS:
				
				nRF_State = BUSY; 
				status = (uint8_t)nRF_State;
			
					if(current_measurement_wait_counter==1)
					{
							i2c_temp_read(); 
							i2c_temp_conv();
					}
					else if(current_measurement_wait_counter==5)
					{
							current_temperature_measurement=i2c_temp_read();
							i2c_RH_conv(); 
					}
					else if(current_measurement_wait_counter==9)
					{
							current_humidity_measurement=i2c_RH_read(); 
					}	
					else if(current_measurement_wait_counter>=10)
					{
						nRF_State = COMPLETE; 
						status = (uint8_t)nRF_State;
						packet_temperature=parameters_merge(0U, (uint16_t)current_temperature_measurement);
						packet_humidity=parameters_merge(0U, (uint16_t)current_humidity_measurement);
						
						ble_rhts_temperature_char_update(&m_rhts, packet_temperature);		
						ble_rhts_humidity_char_update(&m_rhts, packet_humidity);	
						current_measurement_wait_counter=10;
					}
					
					packet_command=command_parameters_merge(measurement_interval_in_minutes, status, command);						
					ble_rhts_command_char_update(&m_rhts, packet_command);						
						
					#if (APP_DEBUG == 1)
							printf("T=%d, H=%d, status=%u, comm=%u\n\r", current_temperature_measurement,
																										current_humidity_measurement,
																										status,
																										command);

						#endif
					current_measurement_wait_counter++;
			
			break;
			
			case CURRENT_MEASUREMENTS_RECEIVED: 

				nRF_State = READY;		
				status = (uint8_t)nRF_State;			
				packet_command=command_parameters_merge(measurement_interval_in_minutes, status, command);						
				ble_rhts_command_char_update(&m_rhts, packet_command);	
				current_measurement_wait_counter=0;
			
						#if (APP_DEBUG == 1)
							printf("MeasCurr received\n\r");
						#endif
			
			break;
			
			case MEASUREMENTS_HISTORY:
						
				if(send_counter < ARRAY_SIZE && History_p->number_of_elements_existing >= send_counter)
				{
					nRF_State = BUSY; 
					status = (uint8_t)nRF_State;
					RHT_step = measurements_history_get_position_from_array(send_counter);
					packet_temperature=parameters_merge((uint16_t)(History_p->time_array[RHT_step]),
																							(uint16_t)(History_p->temperature_value_array[RHT_step]));
					packet_humidity=parameters_merge((uint16_t)(History_p->time_array[RHT_step]),
																							(uint16_t)(History_p->humidity_value_array[RHT_step]));
					packet_command=command_parameters_merge(measurement_interval_in_minutes, status, command);						
					ble_rhts_command_char_update(&m_rhts, packet_command);						
					ble_rhts_temperature_char_update(&m_rhts, packet_temperature);		
					ble_rhts_humidity_char_update(&m_rhts, packet_humidity);	
					send_counter++;
						
					#if (APP_DEBUG == 1)
							printf("Ti%u,T%d,H%d,s%u,c%u\n\r", (History_p->time_array[RHT_step]),
																					History_p->temperature_value_array[RHT_step],
																					History_p->humidity_value_array[RHT_step],
																					status,
																					command);
						#endif
				}
				else 
				{
					nRF_State = COMPLETE; 
					status = (uint8_t)nRF_State;
					packet_temperature=parameters_merge(0U, 0U);
					packet_humidity=parameters_merge(0U, 0U);
					packet_command=command_parameters_merge(measurement_interval_in_minutes, status, command);											
					ble_rhts_temperature_char_update(&m_rhts, packet_temperature);		
					ble_rhts_humidity_char_update(&m_rhts, packet_humidity);	
				}
				
				packet_command=command_parameters_merge(measurement_interval_in_minutes, status, command);						
				ble_rhts_command_char_update(&m_rhts, packet_command);						
	
			break;
			
			case HISTORY_MEASUREMENTS_RECEIVED: 

				nRF_State = READY;	
				status = (uint8_t)nRF_State;
				packet_command=command_parameters_merge(measurement_interval_in_minutes, status, command);						
				ble_rhts_command_char_update(&m_rhts, packet_command);	
				send_counter = 0;
			
						#if (APP_DEBUG == 1)
							printf("History received\n\r");
						#endif
			
			break;
			
			
			case DELETE_HISTORY:
			
				nRF_State = BUSY; 
				erase_measurements_history();
				nRF_State = COMPLETE;
				status = (uint8_t)nRF_State;
				packet_command=command_parameters_merge(measurement_interval_in_minutes, status, command);						
				ble_rhts_command_char_update(&m_rhts, packet_command);	

						#if (APP_DEBUG == 1)
							printf("History deleting\n\r");
						#endif			

			break;
			
			case HISTORY_DELETED: 

				nRF_State = READY;	
				status = (uint8_t)nRF_State;
				packet_command=command_parameters_merge(measurement_interval_in_minutes, status, command);						
				ble_rhts_command_char_update(&m_rhts, packet_command);	
						#if (APP_DEBUG == 1)
							printf("History deleted\n\r");
						#endif	
			break;
			
			case CHANGE_INTERVAL:
				
				nRF_State = BUSY; 
			
				if(measurement_interval_in_minutes <=1)
				{
					measurement_interval_in_minutes=1;
				}
				else if(measurement_interval_in_minutes >=240)
				{
					measurement_interval_in_minutes=240;
				}
				
				interval = (measurement_interval_in_minutes*60);
				#if (APP_DEBUG == 1)
				interval = (measurement_interval_in_minutes*1);
				#endif
				nRF_State = COMPLETE;
				status = (uint8_t)nRF_State;
				packet_command=command_parameters_merge(measurement_interval_in_minutes, status, command);						
				
				ble_rhts_command_char_update(&m_rhts, packet_command);						
				ble_rhts_temperature_char_update(&m_rhts, packet_temperature);		
				ble_rhts_humidity_char_update(&m_rhts, packet_humidity);	
				
						#if (APP_DEBUG == 1)
							printf("Interval changing\n\r");
						#endif	
			
			break;
				
			case INTERVAL_CHANGED:

				nRF_State = READY;	
				status = (uint8_t)nRF_State;
				packet_command=command_parameters_merge(measurement_interval_in_minutes, status, command);						
				ble_rhts_command_char_update(&m_rhts, packet_command);	
			
							#if (APP_DEBUG == 1)
							printf("Interval changed\n\r");
						#endif	
			
			break;
			
			
			case CONNECTED:
			
				nRF_State = READY; 
				status = (uint8_t)nRF_State;
				packet_command=command_parameters_merge(measurement_interval_in_minutes, status, command);						
				
				ble_rhts_command_char_update(&m_rhts, packet_command);						
				ble_rhts_temperature_char_update(&m_rhts, packet_temperature);		
				ble_rhts_humidity_char_update(&m_rhts, packet_humidity);	
				send_counter=0;
				current_measurement_wait_counter = 0; 
			
						#if (APP_DEBUG == 1)
							printf("SimpleConn\n\r");
						#endif	
			
			break;

			
			default:
						#if (APP_DEBUG == 1)
							printf("rec=%u\n\r", received_data);
							printf("com=%u\n\r", command);
						#endif	
			//this should not happen
			break;
			
