Nemo94/RHT_Logger/nRF5_SDK_11.0.0/examples/ble_peripheral/RHT_Logger/main.c
		}

											
		connection_counter++;

		if(connection_counter>=MAX_CONN_EVENTS)
		{
			end_connection();
		}				
			
}


void timer_rht_measurement_event_handler(nrf_timer_event_t event_type, void* p_context)
{	
	#if (APP_DEBUG == 2)
	uint16_t RHT_step =0;
	#endif
    
    switch(event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
					
					NRF_WDT->RR[0] = WDT_RR_RR_Reload;  //reset  watchdog
					timer_overflow_count++;

					
					if(timer_overflow_count==1)
					{
							i2c_temp_read(); 
							i2c_temp_conv();
					}
					else if(timer_overflow_count==3)
					{
							current_temperature_measurement=i2c_temp_read();
							i2c_RH_conv(); 
					}
					else if(timer_overflow_count==5)
					{
							current_humidity_measurement=i2c_RH_read(); 
					}
					else if(timer_overflow_count==7)
					{
							measurements_history_add_element_to_array(current_temperature_measurement, current_humidity_measurement, measurement_interval_in_minutes);
					}
			#if (APP_DEBUG == 2)
					else if(timer_overflow_count==8)
					{
						if(History_p->number_of_elements_existing < ARRAY_SIZE)
						{
							for(int k=0; k<History_p->number_of_elements_existing; k++)
							{
						RHT_step = measurements_history_get_position_from_array(k);
							printf("Ti%u,T%d,H%d\n\r", (History_p->time_array[RHT_step]),
																						History_p->temperature_value_array[RHT_step],
																						History_p->humidity_value_array[RHT_step]);
							}
						}
						else if(History_p->number_of_elements_existing == ARRAY_SIZE+1)
						{
								for(int k=0; k<ARRAY_SIZE; k++)
								{
									RHT_step = measurements_history_get_position_from_array(k);
									printf("Ti%u,T%d,H%d\n\r", (History_p->time_array[RHT_step]),
																						History_p->temperature_value_array[RHT_step],
																						History_p->humidity_value_array[RHT_step]);
							}
						}
						
					}
					#endif
					else if(timer_overflow_count==interval)
					{
						timer_overflow_count=0;
					}
					else
					{
						;
					}					
				
				break;
				
				default:
					break;
			}
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
	ret_code_t err_code;

	uint32_t time_ms = 1000; //Time(in miliseconds) between consecutive compare events.
    uint32_t time_ticks;
	//co sekunde
    // Initialize timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
	    // Initiate our timer
    app_timer_create(&m_connection_event_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
	
	err_code = sd_nvic_SetPriority(TIMER1_IRQn, APP_IRQ_PRIORITY_LOW);
	APP_ERROR_CHECK(err_code);

	err_code = sd_nvic_EnableIRQ(TIMER1_IRQn);
	APP_ERROR_CHECK(err_code);
	
	// Set up counter with new configuration
    nrf_drv_timer_config_t counter_config = NRF_DRV_TIMER_DEFAULT_CONFIG(1);
    //counter_config.mode = NRF_TIMER_MODE_COUNTER;
	counter_config.frequency = NRF_TIMER_FREQ_62500Hz;
	counter_config.bit_width = NRF_TIMER_BIT_WIDTH_16;
	
	
	//Configure TIMER_RHT_MEASUREMENT.
    err_code = nrf_drv_timer_init(&TIMER_RHT_MEASUREMENT, &counter_config, timer_rht_measurement_event_handler);

    APP_ERROR_CHECK(err_code);
    time_ticks = nrf_drv_timer_ms_to_ticks(&TIMER_RHT_MEASUREMENT, time_ms);
    
    nrf_drv_timer_extended_compare(
         &TIMER_RHT_MEASUREMENT, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);
    
    nrf_drv_timer_enable(&TIMER_RHT_MEASUREMENT);
}

void wdt_init(void)
{
	NRF_WDT->CONFIG = (WDT_CONFIG_HALT_Pause << WDT_CONFIG_HALT_Pos) | ( WDT_CONFIG_SLEEP_Run << WDT_CONFIG_SLEEP_Pos);
	NRF_WDT->CRV = 300*32768;   //ca 300 sek. timeout
	NRF_WDT->RREN |= WDT_RREN_RR0_Msk;  //Enable reload register 0
	NRF_WDT->TASKS_START = 1;
}




/**@brief Function for the Power Manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}

#if (APP_DEBUG == 1)

/**
 * @brief UART events handler.
 */
static void uart_events_handler(app_uart_evt_t * p_event)
{
    switch (p_event->evt_type)
    {
        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}

/**
 * @brief UART initialization.
 */
 
static void uart_config(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_events_handler,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);

    APP_ERROR_CHECK(err_code);
}


#endif

/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    leds_init();
	history_struct_init();
    timers_init();
	wdt_init();
	
	#if (APP_DEBUG == 1)
	uart_config();
	#endif
	
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
			twi_master_init();
			htu21d_init();

    // Start execution.
    advertising_start();
	#if (APP_DEBUG ==1)
	printf("Start\n\r");
	#endif
    // Enter main loop.
    for (;;)
    {
        power_manage();
    }
}


/**
 * @}
 */
